app/controllers/images_controller.rb

  def index
    @images = Image.all
---
SELECT * FROM "images"

  def show
    @image = Image.find(params[:id])
---
SELECT * FROM "images" WHERE ("images"."id" = 0)

  def edit
    @image = Image.find(params[:id])
---
SELECT * FROM "images" WHERE ("images"."id" = 1)

  def create
    @image = Image.new(params[:image])

    respond_to do |format|
      if @image.save
---
INSERT INTO "images" ("name", "photo_file_size", "created_at", "owner_rating", "photo_file_name", "updated_at", "gallery_name", "date_time_stamp", "photo_content_type", "user_id", "exifdata", "photo_updated_at", "description") VALUES('Sample1', NULL, '2010-08-01 17:57:00', 4, NULL, '2010-08-01 17:57:00', 'LMWorking', NULL, NULL, 1, '', NULL, 'A rocky seaside')

  def update
    @image = Image.find(params[:id])

    respond_to do |format|
      if @image.update_attributes(params[:image])
---
SELECT * FROM "images" WHERE ("images"."id" = 1)
UPDATE "images" SET "updated_at" = '2010-08-02 02:27:32', "description" = 'A church interior in HDR', "user_id" = 9 WHERE "id" = 8