app/controllers/venues_controller.rb

SELECT * FROM "venues"
---
  def index
    @venues = Venue.all